
# ----------------------------------------------------------------------------
# This script is sourced from `plugins.toml`
# ----------------------------------------------------------------------------

# Alias ----------------------------------------------------------------------
alias ll="ls -alF"
alias la="ls -A"
alias l="ls -CF"

# proto hook -----------------------------------------------------------------
# ディレクトリ移動時に .prototools を検知して環境を切り替える機能
# 少し重いので遅延読み込みさせる
if command -v proto >/dev/null 2>&1; then
  eval "$(proto activate zsh)"
fi

# その他、起動直後に必須ではない重い処理や設定はここに記述